#### 데이터프레임 결합
- 유니언 결합
    - 단순 행, 열 결합 방식
    - pandas에 내장된 concat() 함수 이용
        - concat([데이터프레임, 데이터프레임, ....])
            - axis=
                - 0(rows) : 행 결합
                - 1(columns) : 열 결합
            - ignore_index
                - False(기본값) : 결합 인덱스 보존
                - True : 결합 인덱스 초기화
- 조인 결합
    - 특정한 조건에 맞게 열을 결합하는 방식
    - 데이터 프레임 + 데이터 프레임 조인 결합 -> 특정 컬럼의 데이터들이 같은 값들로 이루어져 있을 때만 열 추가 결합
    - pandas에 내장된 merge() 함수 이용
        - merge(데이터프레임, 데이터프레임)
            - on
                - 조건식(두 개의 데이터프레임이 공통적으로 가지고 있는 컬럼명)
                - 두 데이터프레임의 칼럼명이 다른 경우
                    - 데이터프레임의 컬럼의 이름을 변경하고 merge() 사용
                    - left_on, right_on 매개변수를 이용하여 컬럼명 지정
            - how
                - left : 왼쪽 데이터프레임 기준 열집합
                - right : 오른쪽 데이터프레임 기준 열집합
                - inner : 교집합 기준 집합
                - outer : 합집합

In [1]:
import pandas as pd

In [2]:
data = {
    'name' : ['test', 'test2', 'test3'],
    'age' : [20,30,40]
}
df=pd.DataFrame(data)
df

    name  age
0   test   20
1  test2   30
2  test3   40

In [3]:
data2 = {
    'name': ['test4', 'test5'],
    'loc' : ['Seoul', 'Busan']
}
df2 = pd.DataFrame(data2)
df2

    name    loc
0  test4  Seoul
1  test5  Busan

In [4]:
# 단순 행 결합
pd.concat([df,df2], axis=0, ignore_index=True)

    name   age    loc
0   test  20.0    NaN
1  test2  30.0    NaN
2  test3  40.0    NaN
3  test4   NaN  Seoul
4  test5   NaN  Busan

In [5]:
# 단순 열 결합
pd.concat([df,df2], axis=1, ignore_index=True)

       0   1      2      3
0   test  20  test4  Seoul
1  test2  30  test5  Busan
2  test3  40    NaN    NaN